{
  "personal_info": {
    "name": "Bi Yoo",
    "title": "Lead Software Engineer & Technical Lead",
    "bio": "Senior engineer delivering production AI systems, large-scale ad tech platforms, and data pipelines with measurable revenue impact.",
    "location": "Minnesota, USA",
    "email": "yoobi.dev@gmail.com",
    "phone": "952-567-3505",
    "linkedin": "https://www.linkedin.com/in/biyoo/",
    "github": "https://github.com/biyootiful",
    "website": "https://biyootiful.com",
    "work_authorization": "U.S. Citizen; no sponsorship required",
    "gender": "male"
  },

  "summary": "Senior software engineer and technical lead with deep experience building revenue-focused ad tech systems, high-throughput backend services, data pipelines, and production-ready machine learning applications. Strong end-to-end execution: architecture, implementation, deployment, and product integration. Proven track record in raising system reliability, improving developer velocity, and shipping pragmatic AI-powered features into real products.",

  "capabilities": [
    {
      "id": "bi_capabilities_1",
      "text": "Bi builds real production AI systems. Not research prototypes. He has delivered RAG pipelines end-to-end, including embeddings, retrieval logic, inference routing, evaluation, and integration into user-facing products.",
      "source": "capabilities"
    },
    {
      "id": "bi_capabilities_2",
      "text": "Strong backend experience: Python, Go, Java. High-throughput systems: Kafka, Airflow, streaming ingestion, Snowflake, Druid, distributed services.",
      "source": "capabilities"
    },
    {
      "id": "bi_capabilities_3",
      "text": "Ad tech specialization: bidding, header wrapper strategies, revenue forecasting, payout reconciliation, analytics visualization layers.",
      "source": "capabilities"
    },
    {
      "id": "bi_capabilities_4",
      "text": "Technical leader: mentorship, codebase modernization, architectural ownership, roadmap execution, cross-team alignment.",
      "source": "capabilities"
    }
  ],

  "core_competencies": [
    "Applied Machine Learning (RAG pipelines, embeddings, vector search, latency optimization)",
    "Backend & Distributed Systems (high-throughput services, microservices, streaming data)",
    "Ad Tech Systems (header bidding, forecasting, payout reconciliation, analytics surfaces)",
    "MLOps & Data Engineering (Airflow, Kafka, Snowflake, Druid, feature generation)",
    "Technical Leadership (mentoring, architecture direction, cross-team collaboration)"
  ],

  "skills": {
    "programming_languages": ["Python", "Go", "Java", "TypeScript", "JavaScript", "SQL", "Rust", "Swift"],
    "ml_and_data": ["RAG architectures", "Vector search (Faiss/Milvus/pgvector)", "Embedding evaluation", "Whisper/TTS", "Forecasting models", "Feature engineering"],
    "frameworks": ["FastAPI", "Django", "Spring Boot", "React", "React Native"],
    "datastores": ["Snowflake", "Apache Druid", "PostgreSQL", "MongoDB"],
    "tools": ["AWS", "Kubernetes", "Docker", "Terraform", "Kafka", "Airflow", "CircleCI", "Jenkins", "Git"],
    "soft_skills": ["Technical leadership", "Mentoring", "Roadmapping", "Stakeholder alignment"]
  },

  "experience": [
    {
      "title": "Lead Software Engineer, Ad & Revenue Ops",
      "company": "Insticator",
      "location": "Remote, USA",
      "duration": "Dec 2021 - Present",
      "description": "Tech lead for ad monetization and AI-driven revenue intelligence platforms.",
      "achievements": [
        "Designed and shipped multiple RAG pipelines, including embedding stores, retrieval logic, prompt orchestration, and evaluation harnesses.",
        "Built high-throughput Go and Java services for ad exchange bidding and real-time pixel/event collection.",
        "Delivered revenue forecasting models informing bidding and inventory planning across thousands of publisher properties.",
        "Built combined Snowflake + Druid analytics layers enabling sub-second revenue and engagement queries.",
        "Developed streaming ingestion pipelines using Kafka and Airflow to automate payout reconciliation and reporting.",
        "Mentored distributed engineering team and raised delivery velocity through architecture workflows and refactors.",
        "Led experimentation frameworks using Lambda@Edge to run A/B header bidding strategies, increasing revenue per ad unit."
      ]
    },
    {
      "title": "Senior Software Engineer (Core Platform, Module Lead)",
      "company": "Protenus",
      "location": "Baltimore, MD (Remote)",
      "duration": "Aug 2020 - Dec 2021",
      "description": "Module lead for healthcare compliance analytics platform.",
      "achievements": [
        "Led development of React + Spring Boot features processing large-scale EHR data streams.",
        "Increased automated test coverage to ~80% across UI and API systems.",
        "Shipped workforce analytics dashboards surfacing anomaly detection and ETL health signals.",
        "Improved MongoDB-backed services for performance and reliability in clinical operations workflows.",
        "Integrated ML-driven features into product surfaces through repeatable deployment patterns."
      ]
    },
    {
      "title": "Software Engineer, Front-end & Data Platforms",
      "company": "PreciseTarget",
      "location": "Washington, D.C.",
      "duration": "Jan 2018 - Aug 2020",
      "description": "Full-stack engineer working on retail recommendation systems and data ingestion.",
      "achievements": [
        "Built React/Vue analytics surfaces surfacing large SKU sets and personalization insights.",
        "Implemented ingestion, event tracking, and validation services in Node.js and Python.",
        "Improved PostgreSQL efficiency and reliability for merchandising data pipelines.",
        "Established CI-driven integration testing frameworks to safeguard core algorithms."
      ]
    }
  ],

  "projects": [
    {
      "name": "SaladDays",
      "description": "Mobile nutrition companion with computer vision calorie estimation and LLM coaching.",
      "technologies": ["React Native", "Python", "Vision models", "Vector embeddings", "LLM"],
      "highlights": [
        "Uses multimodal inference to improve food recognition accuracy.",
        "Includes embedded coaching tuned for long-term nutritional adherence."
      ]
    },
    {
      "name": "ML Benchmarking Portal",
      "description": "System for evaluating emerging ML models against ad optimization workloads.",
      "technologies": ["FastAPI", "React", "Faiss", "Evaluation harnesses"],
      "highlights": [
        "Tracks latency, cost, and quality metrics for drop-in model comparisons."
      ]
    }
  ],

  "education": [
    {
      "degree": "M.S. Computer Science (Software Engineering)",
      "institution": "University of Maryland Global Campus"
    },
    {
      "degree": "B.A. Digital Communication (Cum Laude)",
      "institution": "University of Missouri"
    },
    {
      "degree": "B.F.A. Product Design",
      "institution": "Hongik University"
    }
  ]
}
